gallium_testCase/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    floor
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          42;
        startFace       2614;
    }
    ceiling
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          42;
        startFace       2656;
    }
    left
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          32;
        startFace       2698;
    }
    right
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          32;
        startFace       2730;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          2688;
        startFace       2762;
    }
)

// ************************************************************************* //
